Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Linux Preferences
zh_cn: Linux 首选项

source: Mac Preferences
zh_cn: Mac 首选项

source: Scripts Preferences
zh_cn: 脚本首选项

source: Server Preferences
zh_cn: 服务器首选项

source: Source Control Preferences
zh_cn: 源代码控制首选项

source: Steam Preferences
zh_cn: Steam 首选项

source: Tizen Preferences
zh_cn: Tizen首选项

source: Windows Phone Preferences
zh_cn: Windows Phone 首选项

source: Windows8 Preferences
zh_cn: Windows8 首选项

source: Getting Started With Source Control
zh_cn: 开始使用源代码控制

source: Setting Up GM For Source Control
zh_cn: 设置GM用于源代码控制

source: Using Source Control
zh_cn: 使用源代码控制

source: program
zh_cn: 程序

source: assignments
zh_cn: 赋值

source: expressions
zh_cn: 表达式

source: addressing
zh_cn: 寻址

source: arrays
zh_cn: 数组

source: functions
zh_cn: 函数

source: scripts
zh_cn: 脚本

source: comment
zh_cn: 注释

source: Move actions
zh_cn: 更多动作

source: Main actions set 1
zh_cn: 主动作设置1

source: Keywords
zh_cn: 关键字

source: Variables
zh_cn: 变量

source: Main actions set 2
zh_cn: 主动作设置2

source: Obsolete CD Functions
zh_cn: 弃用的CD函数

source: Obsolete Dynamic Functions
zh_cn: 弃用的动态函数

source: Obsolete File Functions
zh_cn: 弃用文件函数

source: Control actions
zh_cn: 控制类动作

source: Score actions
zh_cn: 分数类动作

source: Extra actions
zh_cn: 额外的动作

source: Draw actions
zh_cn: 绘制动作

source: Using expressions and variables
zh_cn: 使用表达式和变量

source: The Windows Menu
zh_cn: 窗口菜单

source: Alarm Event
zh_cn: 计时器事件

source: Async Event
zh_cn: 异步事件

source: Collision Event
zh_cn: 碰撞事件

source: Create Event
zh_cn: 创建事件

source: Destroy Event
zh_cn: 销毁事件

source: Draw Event
zh_cn: 绘制事件

source: Draw GUI Event
zh_cn: GUI绘制事件

source: Keyboard Event
zh_cn: 按键事件

source: Mouse Event
zh_cn: 鼠标事件

source: Other Event
zh_cn: 其它事件

source: Pre And Post Draw Event
zh_cn: Pre 和 Post 绘制事件

source: Resize Event
zh_cn: 调整大小事件

source: //do something
zh_cn: // 做些什么

source: Edit Menu
zh_cn: 编辑菜单

source: File Menu
zh_cn: 文件菜单

source: Images Menu
zh_cn: 图像菜单

source: Transform Menu
zh_cn: 转换菜单

source: View Menu
zh_cn: 视图菜单

source: Global Variables
zh_cn: 全局变量

source: health
zh_cn: 生命值

source: Instance Variables
zh_cn: 实例变量

source: lives
zh_cn: 生命条

source: Local Variables
zh_cn: 局部变量

source: score
zh_cn: 分数

source: <statement>
zh_cn: <语句>

source: return (argument0 * argument0);
zh_cn: return (argument0 * argument0); // 正常的计算面积

source: return 0;
zh_cn: return 0; // 在这里跳出

source: val = scr_sqr(amount);
zh_cn: val = scr_sqr(amount); // 传递变量amount，返回值赋值给val

source: For up-to-date information and troubleshooting hints and tips, please see the YoYo Games Knowledge Base.
zh_cn: 最新信息和疑难解答提示和技巧，请参阅YoYo 游戏知识库。
